src/Catalogs/СертификатыКлючейЭлектроннойПодписиИШифрования/СертификатыКлючейЭлектроннойПодписиИШифрования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СертификатыКлючейЭлектроннойПодписиИШифрования</name>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фирма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействителенДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шифрование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСертификата</name>
    <comment>Двоичные данные сертификата</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Программа</name>
    <type>
      <types>CatalogRef.ПрограммыЭлектроннойПодписиИШифрования</types>
    </type>
  </attributes>
  <attributes>
    <name>Отозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсиленнаяЗащитаЗакрытогоКлюча</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательОповещенОСрокеДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Добавил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаявления</name>
    <type>
      <types>EnumRef.СостоянияЗаявленияНаВыпускСертификата</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеЗаявления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonForms/Сертификат/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.АдресСертификата) Тогда
		ДанныеСертификата = ПолучитьИзВременногоХранилища(Параметры.АдресСертификата);
		Сертификат = Новый СертификатКриптографии(ДанныеСертификата);
		АдресСертификата = ПоместитьВоВременноеХранилище(ДанныеСертификата, УникальныйИдентификатор);
		
	ИначеЕсли ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		АдресСертификата = АдресСертификата(Параметры.Ссылка, УникальныйИдентификатор);
		
		Если АдресСертификата = Неопределено Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось открыть сертификат ""%1"",
                           |т.к. он не найден в справочнике.'
                           |;uk='Не вдається відкрити сертифікат ""%1"",
                           |тому що він не знайдений у довіднику.'"), Параметры.Ссылка);
		КонецЕсли;
	Иначе // Отпечаток
		АдресСертификата = АдресСертификата(Параметры.Отпечаток, УникальныйИдентификатор);
		
		Если АдресСертификата = Неопределено Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось открыть сертификат, т.к. он не найден
                           |по отпечатку ""%1"".'
                           |;uk='Не вдається відкрити сертифікат, тому що його не знайдено
                           |по відбитку ""%1"".'"), Параметры.Отпечаток);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеСертификата = Неопределено Тогда
		ДанныеСертификата = ПолучитьИзВременногоХранилища(АдресСертификата);
		Сертификат = Новый СертификатКриптографии(ДанныеСертификата);
	КонецЕсли;
	
	СтруктураСертификата = ЭлектроннаяПодписьКлиентСервер.ЗаполнитьСтруктуруСертификата(Сертификат);
	
	НазначениеПодписание = Сертификат.ИспользоватьДляПодписи;
	НазначениеШифрование = Сертификат.ИспользоватьДляШифрования;
	
	Отпечаток      = СтруктураСертификата.Отпечаток;
	КомуВыдан      = СтруктураСертификата.КомуВыдан;
	КемВыдан       = СтруктураСертификата.КемВыдан;
	ДействителенДо = СтруктураСертификата.ДействителенДо;
	
	ЗаполнитьКодыНазначенияСертификата(СтруктураСертификата.Назначение, НазначениеКоды);
	
	ЗаполнитьСвойстваСубъекта(Сертификат);
	ЗаполнитьСвойстваИздателя(Сертификат);
	
	ГруппаВнутреннихПолей = "Общие";
	ЗаполнитьВнутренниеПоляСертификата();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаВнутреннихПолейПриИзменении(Элемент)
	
	ЗаполнитьВнутренниеПоляСертификата();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	ЭлектроннаяПодписьСлужебныйКлиент.СохранитьСертификат(Неопределено, АдресСертификата);
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	ЭлектроннаяПодписьКлиент.ПроверитьСертификат(Новый ОписаниеОповещения(
		"ПроверитьЗавершение", ЭтотОбъект), АдресСертификата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Продолжение процедуры Проверить.
&НаКлиенте
Процедура ПроверитьЗавершение(Результат, Неопределен) Экспорт
	
	Если Результат = Истина Тогда
		ПоказатьПредупреждение(, НСтр("ru='Сертификат действителен.';uk='Сертифікат дійсний.'"));
		
	ИначеЕсли Результат <> Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru='Сертификат недействителен по причине:';uk='Сертифікат недійсний з причини:'")
			+ Символы.ПС + Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваСубъекта(Сертификат)
	
	Коллекция = ЭлектроннаяПодписьКлиентСервер.СвойстваСубъектаСертификата(Сертификат);
	
	ПредставленияСвойств = Новый СписокЗначений;
	ПредставленияСвойств.Добавить("ОбщееИмя",         НСтр("ru='Общее имя';uk='Загальне ім''я'"));
	ПредставленияСвойств.Добавить("Страна",           НСтр("ru='Страна';uk='Країна'"));
	ПредставленияСвойств.Добавить("Регион",           НСтр("ru='Регион';uk='Регіон'"));
	ПредставленияСвойств.Добавить("НаселенныйПункт",  НСтр("ru='Населенный пункт';uk='Населений пункт'"));
	ПредставленияСвойств.Добавить("Улица",            НСтр("ru='Улица';uk='Вулиця'"));
	ПредставленияСвойств.Добавить("Организация",      НСтр("ru='Организация';uk='Організація'"));
	ПредставленияСвойств.Добавить("Подразделение",    НСтр("ru='Подразделение';uk='Підрозділ'"));
	ПредставленияСвойств.Добавить("Должность",        НСтр("ru='Должность';uk='Посада'"));
	ПредставленияСвойств.Добавить("ЭлектроннаяПочта", НСтр("ru='Электронная почта';uk='Електронна пошта'"));
	ПредставленияСвойств.Добавить("ОГРН",             НСтр("ru='ОГРН';uk='ОГРН'"));
	ПредставленияСвойств.Добавить("ОГРНИП",           НСтр("ru='ОГРНИП';uk='ОГРНИП'"));
	ПредставленияСвойств.Добавить("СНИЛС",            НСтр("ru='СНИЛС';uk='СНІЛС'"));
	ПредставленияСвойств.Добавить("ИНН",              НСтр("ru='ИНН';uk='ІПН'"));
	ПредставленияСвойств.Добавить("Фамилия",          НСтр("ru='Фамилия';uk='Прізвище'"));
	ПредставленияСвойств.Добавить("Имя",              НСтр("ru='Имя';uk='Ім''я'"));
	ПредставленияСвойств.Добавить("Отчество",         НСтр("ru='Отчество';uk='По батькові'"));
	
	Для каждого ЭлементСписка Из ПредставленияСвойств Цикл
		Если Не ЗначениеЗаполнено(Коллекция[ЭлементСписка.Значение]) Тогда
			Продолжить;
		КонецЕсли;
		Строка = Субъект.Добавить();
		Строка.Свойство = ЭлементСписка.Представление;
		Строка.Значение = Коллекция[ЭлементСписка.Значение];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИздателя(Сертификат)
	
	Коллекция = ЭлектроннаяПодписьКлиентСервер.СвойстваИздателяСертификата(Сертификат);
	
	ПредставленияСвойств = Новый СписокЗначений;
	ПредставленияСвойств.Добавить("ОбщееИмя",         НСтр("ru='Общее имя';uk='Загальне ім''я'"));
	ПредставленияСвойств.Добавить("Страна",           НСтр("ru='Страна';uk='Країна'"));
	ПредставленияСвойств.Добавить("Регион",           НСтр("ru='Регион';uk='Регіон'"));
	ПредставленияСвойств.Добавить("НаселенныйПункт",  НСтр("ru='Населенный пункт';uk='Населений пункт'"));
	ПредставленияСвойств.Добавить("Улица",            НСтр("ru='Улица';uk='Вулиця'"));
	ПредставленияСвойств.Добавить("Организация",      НСтр("ru='Организация';uk='Організація'"));
	ПредставленияСвойств.Добавить("Подразделение",    НСтр("ru='Подразделение';uk='Підрозділ'"));
	ПредставленияСвойств.Добавить("ЭлектроннаяПочта", НСтр("ru='Электронная почта';uk='Електронна пошта'"));
	ПредставленияСвойств.Добавить("ОГРН",             НСтр("ru='ОГРН';uk='ОГРН'"));
	ПредставленияСвойств.Добавить("ИНН",              НСтр("ru='ИНН';uk='ІПН'"));
	
	Для каждого ЭлементСписка Из ПредставленияСвойств Цикл
		Если Не ЗначениеЗаполнено(Коллекция[ЭлементСписка.Значение]) Тогда
			Продолжить;
		КонецЕсли;
		Строка = Издатель.Добавить();
		Строка.Свойство = ЭлементСписка.Представление;
		Строка.Значение = Коллекция[ЭлементСписка.Значение];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВнутренниеПоляСертификата()
	
	ВнутреннееСодержание.Очистить();
	ДвоичныеДанныеСертификата = ПолучитьИзВременногоХранилища(АдресСертификата);
	Сертификат = Новый СертификатКриптографии(ДвоичныеДанныеСертификата);
	
	Если ГруппаВнутреннихПолей = "Общие" Тогда
		ДобавитьСвойство(Сертификат, "Версия",                    НСтр("ru='Версия';uk='Версія'"));
		ДобавитьСвойство(Сертификат, "ДатаНачала",                НСтр("ru='Дата начала';uk='Дата початку'"));
		ДобавитьСвойство(Сертификат, "ДатаОкончания",             НСтр("ru='Дата окончания';uk='Дата закінчення'"));
		ДобавитьСвойство(Сертификат, "ИспользоватьДляПодписи",    НСтр("ru='Использовать для подписи';uk='Використовувати для підпису'"));
		ДобавитьСвойство(Сертификат, "ИспользоватьДляШифрования", НСтр("ru='Использовать для шифрования';uk='Використовувати для шифрування'"));
		ДобавитьСвойство(Сертификат, "ОткрытыйКлюч",              НСтр("ru='Открытый ключ';uk='Відкритий ключ'"), Истина);
		ДобавитьСвойство(Сертификат, "Отпечаток",                 НСтр("ru='Отпечаток';uk='Відбиток'"), Истина);
		ДобавитьСвойство(Сертификат, "СерийныйНомер",             НСтр("ru='Серийный номер';uk='Серійний номер'"), Истина);
	Иначе
		Коллекция = Сертификат[ГруппаВнутреннихПолей];
		Для каждого КлючИЗначение Из Коллекция Цикл
			ДобавитьСвойство(Коллекция, КлючИЗначение.Ключ, КлючИЗначение.Ключ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСвойство(ЗначенияСвойств, Свойство, Представление, НижнийРегистр = Неопределено)
	
	Значение = ЗначенияСвойств[Свойство];
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Значение = МестноеВремя(Значение, ЧасовойПоясСеанса());
	ИначеЕсли ТипЗнч(Значение) = Тип("ФиксированныйМассив") Тогда
		ФиксированныйМассив = Значение;
		Значение = "";
		Для каждого ЭлементМассива Из ФиксированныйМассив Цикл
			Значение = Значение + ?(Значение = "", "", Символы.ПС) + СокрЛП(ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
	Строка = ВнутреннееСодержание.Добавить();
	Строка.Свойство = Представление;
	
	Если НижнийРегистр = Истина Тогда
		Строка.Значение = НРег(Значение);
	Иначе
		Строка.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

// Преобразует назначения сертификатов в коды назначения.
//
// Параметры:
//  Назначение    - Строка - многострочное назначение сертификата, например:
//                           "Microsoft Encrypted File System (1.3.6.1.4.1.311.10.3.4)
//                           |E-mail Protection (1.3.6.1.5.5.7.3.4)
//                           |TLS Web Client Authentication (1.3.6.1.5.5.7.3.2)".
//  
//  КодыНазначения - Строка - коды назначения "1.3.6.1.4.1.311.10.3.4, 1.3.6.1.5.5.7.3.4, 1.3.6.1.5.5.7.3.2".
//
&НаСервере
Процедура ЗаполнитьКодыНазначенияСертификата(Назначение, КодыНазначения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Коды = "";
	
	Для Индекс = 1 По СтрЧислоСтрок(Назначение) Цикл
		
		Строка = СтрПолучитьСтроку(Назначение, Индекс);
		ТекущийКод = "";
		
		Позиция = СтрНайти(Строка, "(", НаправлениеПоиска.СКонца);
		Если Позиция <> 0 Тогда
			ТекущийКод = Сред(Строка, Позиция + 1, СтрДлина(Строка) - Позиция - 1);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущийКод) Тогда
			Коды = Коды + ?(Коды = "", "", ", ") + СокрЛП(ТекущийКод);
		КонецЕсли;
		
	КонецЦикла;
	
	КодыНазначения = Коды;
	
КонецПроцедуры

&НаСервере
Функция АдресСертификата(СсылкаОтпечаток, ИдентификаторФормы = Неопределено)
	
	ДанныеСертификата = Неопределено;
	
	Если ТипЗнч(СсылкаОтпечаток) = Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") Тогда
		Хранилище = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаОтпечаток, "ДанныеСертификата");
		Если ТипЗнч(Хранилище) = Тип("ХранилищеЗначения") Тогда
			ДанныеСертификата = Хранилище.Получить();
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Отпечаток", СсылкаОтпечаток);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Сертификаты.ДанныеСертификата
		|ИЗ
		|	Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК Сертификаты
		|ГДЕ
		|	Сертификаты.Отпечаток = &Отпечаток";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДанныеСертификата = Выборка.ДанныеСертификата.Получить();
		Иначе
			Сертификат = ЭлектроннаяПодписьСлужебный.ПолучитьСертификатПоОтпечатку(СсылкаОтпечаток, Ложь, Ложь);
			Если Сертификат <> Неопределено Тогда
				ДанныеСертификата = Сертификат.Выгрузить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСертификата) = Тип("ДвоичныеДанные") Тогда
		Возврат ПоместитьВоВременноеХранилище(ДанныеСертификата, ИдентификаторФормы);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
